$(function() {
  var size = {
    width: $("#articles").width()-40,
    height: $("#articles").height()-40,
  }

  $("#articles li").eq(0).VerticalTextBox({
    position: {
      x: 7/16*size.width,
      y: 0,
      align: "right"
    },
    rows: [
      {width: 9/16*size.width, height: 1/5*size.height},
      {width: 9/16*size.width, height: 1/5*size.height},
      {width: 9/16*size.width, height: 1/5*size.height},
    ],
    title: {
      text: "乳児に覚醒剤投与、熊本の２４歳男逮捕",
      size: 24,
      reverse: false
    },
    content: {
      text: "熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。県警は認否を明らかにしておらず、詳しい状況や動機を調べている。吉村容疑者は乳児の父親ではないという。逮捕容疑は今年９月４日未明ごろ、熊本市東区のラブホテルで、女性の長男、西田悠真ちゃんに覚醒剤を投与し、殺害した疑い。県警によると、吉村容疑者は４日午前３時すぎ、数年前から交友関係のあった２０代の無職女性＝熊本市南区＝とその長男の３人で、ホテルにチェックインした。４日午後０時半ごろ、ホテルにいた女性が「子供が泡を吹いて固まっている」と１１０番。長男は病院に運ばれたが、覚醒剤中毒で死亡した。警察官が駆け付けた際、吉村容疑者はホテルにはいなかった。吉村容疑者と女性は事件後、覚醒剤を使用したとして逮捕、起訴され、ともに執行猶予付き判決を受けている。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。",
      size: 18
    },
    image: {
      src: "https://pbs.twimg.com/profile_images/378800000220029324/fe66faeca20115da8566e51d83447ead_400x400.jpeg"
    }
  });

  $("#articles li").eq(1).VerticalTextBox({
    position: {
      x: 3/16*size.width,
      y: 0,
      align: "left"
    },
    rows: [
      {width: 4/16*size.width, height: 1/5*size.height},
      {width: 4/16*size.width, height: 1/5*size.height},
      {width: 4/16*size.width, height: 1/5*size.height},
      {width: 6/16*size.width, height: 1/5*size.height},
    ],
    title: {
      text: "乳児に覚醒剤投与、熊本の２４歳男逮捕",
      size: 24,
      reverse: false
    },
    content: {
      text: "熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。県警は認否を明らかにしておらず、詳しい状況や動機を調べている。吉村容疑者は乳児の父親ではないという。逮捕容疑は今年９月４日未明ごろ、熊本市東区のラブホテルで、女性の長男、西田悠真ちゃんに覚醒剤を投与し、殺害した疑い。県警によると、吉村容疑者は４日午前３時すぎ、数年前から交友関係のあった２０代の無職女性＝熊本市南区＝とその長男の３人で、ホテルにチェックインした。４日午後０時半ごろ、ホテルにいた女性が「子供が泡を吹いて固まっている」と１１０番。長男は病院に運ばれたが、覚醒剤中毒で死亡した。警察官が駆け付けた際、吉村容疑者はホテルにはいなかった。吉村容疑者と女性は事件後、覚醒剤を使用したとして逮捕、起訴され、ともに執行猶予付き判決を受けている。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。",
      size: 18
    }
  });

  $("#articles li").eq(2).VerticalTextBox({
    position: {
      x: 0/16*size.width,
      y: 0,
      align: "right"
    },
    rows: [
      {width: 3/16*size.width, height: 1/5*size.height},
      {width: 3/16*size.width, height: 1/5*size.height},
      {width: 3/16*size.width, height: 1/5*size.height},
    ],
    title: {
      text: "乳児に覚醒剤投与、熊本の２４歳男逮捕",
      size: 24,
      reverse: false
    },
    content: {
      text: "熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。県警は認否を明らかにしておらず、詳しい状況や動機を調べている。吉村容疑者は乳児の父親ではないという。逮捕容疑は今年９月４日未明ごろ、熊本市東区のラブホテルで、女性の長男、西田悠真ちゃんに覚醒剤を投与し、殺害した疑い。県警によると、吉村容疑者は４日午前３時すぎ、数年前から交友関係のあった２０代の無職女性＝熊本市南区＝とその長男の３人で、ホテルにチェックインした。４日午後０時半ごろ、ホテルにいた女性が「子供が泡を吹いて固まっている」と１１０番。長男は病院に運ばれたが、覚醒剤中毒で死亡した。警察官が駆け付けた際、吉村容疑者はホテルにはいなかった。吉村容疑者と女性は事件後、覚醒剤を使用したとして逮捕、起訴され、ともに執行猶予付き判決を受けている。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。",
      size: 18
    }
  });

  $("#articles li").eq(3).VerticalTextBox({
    position: {
      x: 8/16*size.width,
      y: 3/5*size.height,
      align: "right"
    },
    rows: [
      {width: 7/16*size.width, height: 1/5*size.height},
      {width: 8/16*size.width, height: 1/5*size.height},
    ],
    title: {
      text: "乳児に覚醒剤投与男逮捕",
      size: 24,
      reverse: false
    },
    content: {
      text: "熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。県警は認否を明らかにしておらず、詳しい状況や動機を調べている。吉村容疑者は乳児の父親ではないという。逮捕容疑は今年９月４日未明ごろ、熊本市東区のラブホテルで、女性の長男、西田悠真ちゃんに覚醒剤を投与し、殺害した疑い。県警によると、吉村容疑者は４日午前３時すぎ、数年前から交友関係のあった２０代の無職女性＝熊本市南区＝とその長男の３人で、ホテルにチェックインした。４日午後０時半ごろ、ホテルにいた女性が「子供が泡を吹いて固まっている」と１１０番。長男は病院に運ばれたが、覚醒剤中毒で死亡した。警察官が駆け付けた際、吉村容疑者はホテルにはいなかった。吉村容疑者と女性は事件後、覚醒剤を使用したとして逮捕、起訴され、ともに執行猶予付き判決を受けている。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。",
      size: 18
    }
  });

  $("#articles li").eq(4).VerticalTextBox({
    position: {
      x: 4/16*size.width,
      y: 4/5*size.height,
      align: "right"
    },
    rows: [
      {width: 4/16*size.width, height: 1/5*size.height},
    ],
    title: {
      text: "２４歳男逮捕",
      size: 24,
      reverse: false
    },
    content: {
      text: "熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。県警は認否を明らかにしておらず、詳しい状況や動機を調べている。吉村容疑者は乳児の父親ではないという。逮捕容疑は今年９月４日未明ごろ、熊本市東区のラブホテルで、女性の長男、西田悠真ちゃんに覚醒剤を投与し、殺害した疑い。県警によると、吉村容疑者は４日午前３時すぎ、数年前から交友関係のあった２０代の無職女性＝熊本市南区＝とその長男の３人で、ホテルにチェックインした。４日午後０時半ごろ、ホテルにいた女性が「子供が泡を吹いて固まっている」と１１０番。長男は病院に運ばれたが、覚醒剤中毒で死亡した。警察官が駆け付けた際、吉村容疑者はホテルにはいなかった。吉村容疑者と女性は事件後、覚醒剤を使用したとして逮捕、起訴され、ともに執行猶予付き判決を受けている。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。",
      size: 18
    }
  });

  $("#articles li").eq(5).VerticalTextBox({
    position: {
      x: 0/16*size.width,
      y: 3/5*size.height,
      align: "left"
    },
    rows: [
      {width: 3/16*size.width, height: 1/5*size.height},
      {width: 4/16*size.width, height: 1/5*size.height},
    ],
    title: {
      text: "２４歳男逮捕",
      size: 24,
      reverse: false
    },
    content: {
      text: "熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。県警は認否を明らかにしておらず、詳しい状況や動機を調べている。吉村容疑者は乳児の父親ではないという。逮捕容疑は今年９月４日未明ごろ、熊本市東区のラブホテルで、女性の長男、西田悠真ちゃんに覚醒剤を投与し、殺害した疑い。県警によると、吉村容疑者は４日午前３時すぎ、数年前から交友関係のあった２０代の無職女性＝熊本市南区＝とその長男の３人で、ホテルにチェックインした。４日午後０時半ごろ、ホテルにいた女性が「子供が泡を吹いて固まっている」と１１０番。長男は病院に運ばれたが、覚醒剤中毒で死亡した。警察官が駆け付けた際、吉村容疑者はホテルにはいなかった。吉村容疑者と女性は事件後、覚醒剤を使用したとして逮捕、起訴され、ともに執行猶予付き判決を受けている。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。熊本県警は６日、知人女性の生後３カ月の乳児に覚醒剤を投与して殺害したとして、殺人と覚せい剤取締法違反（使用）の疑いなどで熊本県益城町宮園、自称会社員、吉村天翔容疑者（２４）を逮捕した。",
      size: 18
    }
  });
});
